import { DictBase } from '../../dict';

export default {
  category: '人物',
  title: 'エージェント',
  hinshi: '人名',
  items: [
    // 邪兎屋
    { kana: 'あんびー', word: 'アンビー' },
    { kana: 'あんびーでまら', word: 'アンビー・デマラ' },
    { kana: 'にこ', word: 'ニコ' },
    { kana: 'にこでまら', word: 'ニコ・デマラ' },
    { kana: 'ねこまた', word: '猫又' },
    { kana: 'ねこみやまな', word: '猫宮又奈' },
    { kana: 'びりー', word: 'ビリー' },
    { kana: 'びりーきっど', word: 'ビリー・キッド' },
    // ヴィクトリア家政
    { kana: 'えれん', word: 'エレン' },
    { kana: 'えれんじょー', word: 'エレン・ジョー' },
    { kana: 'かりん', word: 'カリン' },
    { kana: 'かりんうぃくす', word: 'カリン・ウィクス' },
    { kana: 'らいかん', word: 'ライカン' },
    { kana: 'ふぉんらいかん', word: 'フォン・ライカン' },
    { kana: 'りな', word: 'リナ' },
    { kana: 'あれくさんどりな', word: 'アレクサンドリナ' },
    { kana: 'あれくさんどりなせばすちゃん', word: 'アレクサンドリナ・セバスチャン' },
    // 白祇重工
    { kana: 'あんどー', word: 'アンドー' },
    { kana: 'あんどーいわのふ', word: 'アンドー・イワノフ' },
    { kana: 'くれた', word: 'クレタ' },
    { kana: 'くれたべろぼーぐ', word: 'クレタ・ベロボーグ' },
    { kana: 'ぐれーす', word: 'グレース' },
    { kana: 'ぐれーすはわーど', word: 'グレース・ハワード' },
    { kana: 'べん', word: 'ベン' },
    { kana: 'べんびがー', word: 'ベン・ビガー' },
    // オボルス小隊
    { kana: 'じゅういちごう', word: '11号' },
    // 特務捜査班
    { kana: 'しゅえん', word: '朱鳶' },
    { kana: 'ちんいー', word: '青衣' },
    { kana: 'せす', word: 'セス' },
    { kana: 'せすろーうぇる', word: 'セス・ローウェル' },
    { kana: 'じぇーんどぅ', word: 'ジェーン・ドゥ' },
    // カリュドーンの子
    { kana: 'ぱいぱー', word: 'パイパー' },
    { kana: 'ぱいぱーうぃーる', word: 'パイパー・ウィール' },
    { kana: 'るーしー', word: 'ルーシー' },
    {
      kana: 'るしあーなおくしすぃーすておどろでもんてふぃーの',
      word: 'ルシアーナ・オクシスィース・テオドロ・デ・モンテフィーノ',
    },
    { kana: 'しーざー', word: 'シーザー' },
    { kana: 'きんぐしーざー', word: 'キング・シーザー' },
    // 対ホロウ6課
    { kana: 'ほしみみやび', word: '星見雅' },
    { kana: 'そうかく', word: '蒼角' },
    { kana: 'はるまさ', word: '悠真' },
    { kana: 'あさばはるまさ', word: '浅羽悠真' },
    { kana: 'つきしろやなぎ', word: '月城柳' },
  ],
} as DictBase;
