import { DictBase } from '../../dict';

export default {
  category: 'アイテム',
  title: 'ドライバディスク',
  hinshi: '普通名詞',
  items: [
    { kana: 'こんとんのへヴぃめたる', word: '混沌のヘヴィメタル' },
    { kana: 'すいんぐじゃず', word: 'スイング・ジャズ' },
    { kana: 'じゅうがのへヴぃめたる', word: '獣牙のヘヴィメタル' },
    { kana: 'ほるもんぱんく', word: 'ホルモン・パンク' },
    { kana: 'へきれきのへヴぃめたる', word: '霹靂のヘヴィメタル' },
    { kana: 'しょっくすたーでぃすこ', word: 'ショックスター・ディスコ' },
    { kana: 'うっどぺっかーえれくとろ', word: 'ウッドペッカー・エレクトロ' },
    { kana: 'そうるろっく', word: 'ソウル・ロック' },
    { kana: 'えんごくのへヴぃめたる', word: '炎獄のヘヴィメタル' },
    { kana: 'ぱふぁーえれくとろ', word: 'パファー・エレクトロ' },
    { kana: 'きょくちのへヴぃめたる', word: '極地のヘヴィメタル' },
    { kana: 'ふりーだむぶるーす', word: 'フリーダム・ブルース' },
    { kana: 'けいおすじゃず', word: 'ケイオス・ジャズ' },
    { kana: 'ぷろとぱんく', word: 'プロト・パンク' },
  ],
} as DictBase;
